org/bootstrap.org
#+TITLE: Introducción a Bootstrap
#+AUTHOR: Patricio Martínez
#+EMAIL: maxxcan@gmail.coma

* Introducción

** Qué es bootstrap

Bootstrap es un potente framework para front-end hace más fácil y rápido el desarrollo web. Incluye plantillas de CSS y HTML y componentes comunes para el interfaz de usuario como tipografía, formularios, botones, tablas, desplegables, alertas, pestañas, carruseles y muchas más cosas.

Bootstrap también ofrece la habilidad de crear páginas responsivas con mucho menos esfuerzo.

** Ventajas de Bootstrap


La mayor ventaja de usar Bootstrap es que trae un completo conjunto de herramientas para crear flexibles y responsivas capas web así como componentes para interfaces. 

Además, usando los datos de la API de Bootstrap podemos crear avanzados componentes de interfaces como Scrollspy y Typeaheads sin escribir ni una sola línea de código javascript. 

Aquí algunas ventajas más:

+ *Se salva mucho tiempo*. Con Bootstrap se salva mucho tiempo ya que disponemos de gran cantidad de clases y plantillas pudiendo así concentrarnos en otras áreas del desarrollo web.
+ *Características responsivas*. Usando Bootstrap podemos fácilmente crear diseños responsivos, así podrán funcionar correcgtamente en distintos dispositvos y a distintas resoluciones.
+ *Diseño consistente*. Todos los componentes comparten el mismo diseño y estilos. Así mantenemos una consisgtencia de estilos en el desarrollo.
+ *Fácil de usar*. Bootstrap es muy fácil de usar, cualquier persona con básicos conocimientos de HTML y CSS puede empezar a desarrollar con Bootstrap.
+ *Compatibles con navegadores*. Bootstrap es creado para los modernos navegadores en mente y para que funcione en cada uno de ellos.
+ *Open Source* Esta es la mejor parte, es completamente libre de descargar y usar.

* Empezando con Bootstrap

** Empezando con Bootstrap

Aquí vamos a aprender como crear fácilmente una página con Bootstrap. Para empezar necesitamos un buen editor (Emacs es el mejor) y conocimientos básicos en HTML y CSS.

** Descargando los ficheros de Bootstrap

Hay dos versiones para descargar, *una compilada* y los *fuentes*. Podemos descargarlo desde [[http://getbootstrap.com/getting-started/][aquí]]

La versión compilada trae una versión compilada y minimizada de los ficheros JavaScript y CSS, así como iconos y fuentes. Con la versión de *fuente* tendremos todos los ficheros JavaScript y CSS y además una copia de la documentación.

Para nuestro caso usaremos la versión compilada, ya que la otra es más bien para desarrollo. Además la versión compilada se ejecuta antes y hace que nuestras paginas se carguen más rápidamente.

** Entendiendo la estructura de archivos

Una vez descargada la versión compilada si descomprimimos el fichero podemos ver la siguiente estructura:


bootstrap/
| —— css/   |                                      |
|           | —— bootstrap.css                     |
|           | —— bootstrap.min.css                 |
|           | —— bootstrap-theme.css               |
|           | —— bootstrap-theme.min.css           |
| —— js/    |                                      |
|           | —— bootstrap.js                      |
|           | —— bootstrap.min.js                  |
| —— fonts/ |                                      |
|           | —— glyphicons-halflings-regular.eot  |
|           | —— glyphicons-halflings-regular.svg  |
|           | —— glyphicons-halflings-regular.ttf  |
|           | —— glyphicons-halflings-regular.woff |
|           |                                      |

** Creando nuestra primera página con Bootstrap

Una vez entendida la estructura es hora de ponernos a ello. La plantilla de Bootstrap incluye todo lo que nosotros hemos mencionado en la estructura. 

Vamos a crear una serie de pasos para crear nuestra primera página con Bootstrap

*** Paso 1. Creando un fichero HTML básico

Crearemos un fichero HTML lo más básico posible:

#+begin_src html
<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>HTML Básico</title>
</head>
<body>
    <h1>Hola, Mundo!</h1>
</body>
</html>                                		
#+end_src

