doc/html/bootstrap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-25 mar 12:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducción a Bootstrap</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Patricio Martínez" />
<link rel="stylesheet" type="text/css" href="themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introducción a Bootstrap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcd3ed7c">Introducción</a>
<ul>
<li><a href="#org907f23d">Qué es bootstrap</a></li>
<li><a href="#orgde8e2b0">Ventajas de Bootstrap</a></li>
</ul>
</li>
<li><a href="#org6b024c5">Empezando con Bootstrap</a>
<ul>
<li><a href="#org84818a8">Empezando con Bootstrap</a></li>
<li><a href="#org931cf56">Descargando los ficheros de Bootstrap</a></li>
<li><a href="#org00dd5b5">Entendiendo la estructura de archivos</a></li>
<li><a href="#org7616039">Creando nuestra primera página con Bootstrap</a>
<ul>
<li><a href="#org6f3b02b">Paso 1. Creando un fichero HTML básico</a></li>
<li><a href="#org96b3fd9">Paso 2. Hacer este HTML una plantilla de Bootstrap</a></li>
<li><a href="#orge5807b8">Incluyendo los ficheros de Bootstrap vía CDN</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc141b02">Sistema de rejilla de Bootstrap</a>
<ul>
<li><a href="#orgf4c4959">Qué es el sistema de rejilla de Bootstrap</a></li>
<li><a href="#org332ba15">Creando un diseño de 2 columnas</a></li>
<li><a href="#orgb4f21df">Creando un diseño de 3 columnas</a></li>
<li><a href="#org2b395cf">Diseño de Bootstrap con la característica de envoltura de columna</a></li>
<li><a href="#org948d933">Creando diseños multicolumna con el sistema de rejilla de Bootstrap</a></li>
<li><a href="#org3d53729">Compensación de las columnas en la rejilla</a></li>
<li><a href="#org8ebcb32">Rejilla de columnas anidadas</a></li>
<li><a href="#org16d7ff1">Clases responsivas para Bootstrap</a></li>
</ul>
</li>
<li><a href="#org0402e10">Diseños fijos</a>
<ul>
<li><a href="#orgb858b56">Creando diseños fijos</a></li>
</ul>
</li>
<li><a href="#org3dcb90f">Diseños fluidos con Bootstrap</a>
<ul>
<li><a href="#org0ab363c">Creando diseños fluidos con Bootstrap</a></li>
</ul>
</li>
<li><a href="#org037ff1c">Tipografía en Bootstrap</a>
<ul>
<li><a href="#org3c11ae1">Trabajando con cabeceras</a></li>
<li><a href="#org7abb227">Trabajando con párrafos</a></li>
<li><a href="#org00bf998">Formateado de texto</a></li>
<li><a href="#orgf783d11">Clases para transformar texto</a></li>
<li><a href="#orga2726d5">Clases para enfatizar el texto</a></li>
<li><a href="#org8bacdd0">Bloques de citas con estilo</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcd3ed7c" class="outline-2">
<h2 id="orgcd3ed7c">Introducción</h2>
<div class="outline-text-2" id="text-orgcd3ed7c">
</div><div id="outline-container-org907f23d" class="outline-3">
<h3 id="org907f23d">Qué es bootstrap</h3>
<div class="outline-text-3" id="text-org907f23d">
<p>
Bootstrap es un potente framework para front-end hace más fácil y rápido el desarrollo web. Incluye plantillas de CSS y HTML y componentes comunes para el interfaz de usuario como tipografía, formularios, botones, tablas, desplegables, alertas, pestañas, carruseles y muchas más cosas.
</p>

<p>
Bootstrap también ofrece la habilidad de crear páginas responsivas con mucho menos esfuerzo.
</p>
</div>
</div>

<div id="outline-container-orgde8e2b0" class="outline-3">
<h3 id="orgde8e2b0">Ventajas de Bootstrap</h3>
<div class="outline-text-3" id="text-orgde8e2b0">
<p>
La mayor ventaja de usar Bootstrap es que trae un completo conjunto de herramientas para crear flexibles y responsivas capas web así como componentes para interfaces. 
</p>

<p>
Además, usando los datos de la API de Bootstrap podemos crear avanzados componentes de interfaces como Scrollspy y Typeaheads sin escribir ni una sola línea de código javascript. 
</p>

<p>
Aquí algunas ventajas más:
</p>

<ul class="org-ul">
<li><b>Se salva mucho tiempo</b>. Con Bootstrap se salva mucho tiempo ya que disponemos de gran cantidad de clases y plantillas pudiendo así concentrarnos en otras áreas del desarrollo web.</li>
<li><b>Características responsivas</b>. Usando Bootstrap podemos fácilmente crear diseños responsivos, así podrán funcionar correcgtamente en distintos dispositvos y a distintas resoluciones.</li>
<li><b>Diseño consistente</b>. Todos los componentes comparten el mismo diseño y estilos. Así mantenemos una consisgtencia de estilos en el desarrollo.</li>
<li><b>Fácil de usar</b>. Bootstrap es muy fácil de usar, cualquier persona con básicos conocimientos de HTML y CSS puede empezar a desarrollar con Bootstrap.</li>
<li><b>Compatibles con navegadores</b>. Bootstrap es creado para los modernos navegadores en mente y para que funcione en cada uno de ellos.</li>
<li><b>Open Source</b> Esta es la mejor parte, es completamente libre de descargar y usar.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6b024c5" class="outline-2">
<h2 id="org6b024c5">Empezando con Bootstrap</h2>
<div class="outline-text-2" id="text-org6b024c5">
</div><div id="outline-container-org84818a8" class="outline-3">
<h3 id="org84818a8">Empezando con Bootstrap</h3>
<div class="outline-text-3" id="text-org84818a8">
<p>
Aquí vamos a aprender como crear fácilmente una página con Bootstrap. Para empezar necesitamos un buen editor (Emacs es el mejor) y conocimientos básicos en HTML y CSS.
</p>
</div>
</div>

<div id="outline-container-org931cf56" class="outline-3">
<h3 id="org931cf56">Descargando los ficheros de Bootstrap</h3>
<div class="outline-text-3" id="text-org931cf56">
<p>
Hay dos versiones para descargar, <b>una compilada</b> y los <b>fuentes</b>. Podemos descargarlo desde <a href="http://getbootstrap.com/getting-started/">aquí</a>
</p>

<p>
La versión compilada trae una versión compilada y minimizada de los ficheros JavaScript y CSS, así como iconos y fuentes. Con la versión de <b>fuente</b> tendremos todos los ficheros JavaScript y CSS y además una copia de la documentación.
</p>

<p>
Para nuestro caso usaremos la versión compilada, ya que la otra es más bien para desarrollo. Además la versión compilada se ejecuta antes y hace que nuestras paginas se carguen más rápidamente.
</p>
</div>
</div>

<div id="outline-container-org00dd5b5" class="outline-3">
<h3 id="org00dd5b5">Entendiendo la estructura de archivos</h3>
<div class="outline-text-3" id="text-org00dd5b5">
<p>
Una vez descargada la versión compilada si descomprimimos el fichero podemos ver la siguiente estructura:
</p>


<p>
bootstrap/
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">—— css/</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— bootstrap.css</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— bootstrap.min.css</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— bootstrap-theme.css</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— bootstrap-theme.min.css</td>
</tr>

<tr>
<td class="org-left">—— js/</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— bootstrap.js</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— bootstrap.min.js</td>
</tr>

<tr>
<td class="org-left">—— fonts/</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— glyphicons-halflings-regular.eot</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— glyphicons-halflings-regular.svg</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— glyphicons-halflings-regular.ttf</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">—— glyphicons-halflings-regular.woff</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7616039" class="outline-3">
<h3 id="org7616039">Creando nuestra primera página con Bootstrap</h3>
<div class="outline-text-3" id="text-org7616039">
<p>
Una vez entendida la estructura es hora de ponernos a ello. La plantilla de Bootstrap incluye todo lo que nosotros hemos mencionado en la estructura. 
</p>

<p>
Vamos a crear una serie de pasos para crear nuestra primera página con Bootstrap
</p>
</div>

<div id="outline-container-org6f3b02b" class="outline-4">
<h4 id="org6f3b02b">Paso 1. Creando un fichero HTML básico</h4>
<div class="outline-text-4" id="text-org6f3b02b">
<p>
Crearemos un fichero HTML lo más básico posible:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
    &lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
    &lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
    &lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
    &lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">HTML B&#225;sico</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;<span class="org-underline"><span class="org-bold">Hola, Mundo!</span></span>&lt;/<span class="org-function-name">h1</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>
</div>
</div>
