org/bootstrap.org
*** Paso 2. Hacer este HTML una plantilla de Bootstrap

Para ello incluiremos los ficheros CSS y JavaScript necesarios. Podemos incluir los ficheros JavaScript al final de la página, antes incluso de que se cierre la etiqueta <body> para mejorar el rendimiento de la página web.

#+begin_src html

<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Basic Bootstrap Template</title>
<link rel="stylesheet" type="text/css" href="/examples/css/bootstrap.min.css">
<!-- Optional Bootstrap theme -->
<link rel="stylesheet" href="/examples/css/bootstrap-theme.min.css">
</head>
<body>
    <h1>Hello, world!</h1>
    <script src="https://code.jquery.com/jquery-1.12.4.min.js"></script>
    <script src="/examples/js/bootstrap.min.js"></script>
</body>
</html>                                		

#+end_src

*** Incluyendo los ficheros de Bootstrap vía CDN

También podemos añadir los ficheros JavaScript y CSS vía CDN ( Content Delivery Network). Los beneficios de usar este mecanismo son los mismos que hemos visto en el caso de JQuery.

Veamos este ejemplo: 

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Basic Bootstrap Template</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">
<!-- Optional Bootstrap theme -->
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap-theme.min.css" integrity="sha384-rHyoN1iRsVXV4nD0JutlnGaslCJuC7uwjduW9SVrLvRYooPp2bWYgmgJQIXwl/Sp" crossorigin="anonymous">
</head>
<body>
    <h1>Hello, world!</h1>
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
    <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha384-Tc5IQib027qvyjSMfHjOMaLkfuWVxZxUPnCJA7l2mCWNIpG9mGCD8wGNIcPD7Txa" crossorigin="anonymous"></script>
</body>
</html>                                		
#+end_src

Los atributos *integrity* y *crossorigin* son para implementar el SRI (Subresources Integrity). Un mecanismo de seguridad para mitigar el riesgo de un ataque originados desde CDN comprometidos. 

* Sistema de rejilla de Bootstrap

** Qué es el sistema de rejilla de Bootstrap

Bootstrap ofrece un rápido y fácil sistema para crear capas web responsivas. Bootstrap incluye clases de rejilla predefinidas para hacer de manera rápida y fácil capas de rejillas para diferentes dispositivos. Por ejemplo, nosotros podemos usar la clase *.col-xs-* para crear una rejilla en un dispositivo muy pequeño como es un móvil. La siguiente tabla resume esto:

| Característica               | Dispositivos extra-pequeños | Dispositivos Pequeños                | Dispositivos Medianos | Dispositivos grandes |
|------------------------------+-----------------------------+--------------------------------------+-----------------------+----------------------|
| Máximo tamaño del contenedor | Ninguno (auto)              | 750px                                | 970px                 | 1170px               |
| Comportamiento de la rejilla | Todo el tiempo horizontal   | Colapsada al principio y ya después. |                       |                      |
| Prefijo de la clase          | .col-xs-                    | .col-sm                              | .col-md-              | .col-mx-             |
| Máxima anchura columnas      | Auto                        | ~62px                                | ~81px                 | ~97px                |


Aquí hay una cosa muy importante, si aplicamos .col-sm- no solo afectará a un elemento de tamaño pequeño sino también a los de tamaño medianos y grandes si las clases .xol-md- y .col-mx- no están presentes. Lo mismo para la clase .col-md- que no solo se aplicará a los dispositivos medianos sino también a los grandes si la clase .col-mx no está presente. 

Ahora la pregunta llega cuando queremos crear columnas y filas usando este sistema responsivo de rejilla de 12 columnas. La respuesta es muy sencilla, al principio creamos un contenedor que actúa como una envoltura para tus filas y columnas usando la clase *.row* y creamos columnas dentro de cualquier fila usando la clase .col-xs-, .col-sm, .col-md- y col-mx-. Las columnas estarán contenidas realmente en el área en donde tenemos nuestro contenido 

