doc/html/bootstrap.html

<div id="outline-container-org96b3fd9" class="outline-4">
<h4 id="org96b3fd9">Paso 2. Hacer este HTML una plantilla de Bootstrap</h4>
<div class="outline-text-4" id="text-org96b3fd9">
<p>
Para ello incluiremos los ficheros CSS y JavaScript necesarios. Podemos incluir los ficheros JavaScript al final de la página, antes incluso de que se cierre la etiqueta &lt;body&gt; para mejorar el rendimiento de la página web.
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Basic Bootstrap Template</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span> <span class="org-variable-name">href</span>=<span class="org-string">"/examples/css/bootstrap.min.css"</span>&gt;
<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Optional Bootstrap theme </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"/examples/css/bootstrap-theme.min.css"</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;<span class="org-underline"><span class="org-bold">Hello, world!</span></span>&lt;/<span class="org-function-name">h1</span>&gt;
    &lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://code.jquery.com/jquery-1.12.4.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
    &lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"/examples/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   

</pre>
</div>
</div>
</div>

<div id="outline-container-orge5807b8" class="outline-4">
<h4 id="orge5807b8">Incluyendo los ficheros de Bootstrap vía CDN</h4>
<div class="outline-text-4" id="text-orge5807b8">
<p>
También podemos añadir los ficheros JavaScript y CSS vía CDN ( Content Delivery Network). Los beneficios de usar este mecanismo son los mismos que hemos visto en el caso de JQuery.
</p>

<p>
Veamos este ejemplo: 
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Basic Bootstrap Template</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;
<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Optional Bootstrap theme </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap-theme.min.css"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-rHyoN1iRsVXV4nD0JutlnGaslCJuC7uwjduW9SVrLvRYooPp2bWYgmgJQIXwl/Sp"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;<span class="org-underline"><span class="org-bold">Hello, world!</span></span>&lt;/<span class="org-function-name">h1</span>&gt;
    &lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
    &lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span> <span class="org-variable-name">integrity</span>=<span class="org-string">"sha384-Tc5IQib027qvyjSMfHjOMaLkfuWVxZxUPnCJA7l2mCWNIpG9mGCD8wGNIcPD7Txa"</span> <span class="org-variable-name">crossorigin</span>=<span class="org-string">"anonymous"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>

<p>
Los atributos <b>integrity</b> y <b>crossorigin</b> son para implementar el SRI (Subresources Integrity). Un mecanismo de seguridad para mitigar el riesgo de un ataque originados desde CDN comprometidos. 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc141b02" class="outline-2">
<h2 id="orgc141b02">Sistema de rejilla de Bootstrap</h2>
<div class="outline-text-2" id="text-orgc141b02">
</div><div id="outline-container-orgf4c4959" class="outline-3">
<h3 id="orgf4c4959">Qué es el sistema de rejilla de Bootstrap</h3>
<div class="outline-text-3" id="text-orgf4c4959">
<p>
Bootstrap ofrece un rápido y fácil sistema para crear capas web responsivas. Bootstrap incluye clases de rejilla predefinidas para hacer de manera rápida y fácil capas de rejillas para diferentes dispositivos. Por ejemplo, nosotros podemos usar la clase <b>.col-xs-</b> para crear una rejilla en un dispositivo muy pequeño como es un móvil. La siguiente tabla resume esto:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Característica</th>
<th scope="col" class="org-left">Dispositivos extra-pequeños</th>
<th scope="col" class="org-left">Dispositivos Pequeños</th>
<th scope="col" class="org-left">Dispositivos Medianos</th>
<th scope="col" class="org-left">Dispositivos grandes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Máximo tamaño del contenedor</td>
<td class="org-left">Ninguno (auto)</td>
<td class="org-left">750px</td>
<td class="org-left">970px</td>
<td class="org-left">1170px</td>
</tr>

<tr>
<td class="org-left">Comportamiento de la rejilla</td>
<td class="org-left">Todo el tiempo horizontal</td>
<td class="org-left">Colapsada al principio y ya después.</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Prefijo de la clase</td>
<td class="org-left">.col-xs-</td>
<td class="org-left">.col-sm</td>
<td class="org-left">.col-md-</td>
<td class="org-left">.col-mx-</td>
</tr>

<tr>
<td class="org-left">Máxima anchura columnas</td>
<td class="org-left">Auto</td>
<td class="org-left">~62px</td>
<td class="org-left">~81px</td>
<td class="org-left">~97px</td>
</tr>
</tbody>
</table>


<p>
Aquí hay una cosa muy importante, si aplicamos .col-sm- no solo afectará a un elemento de tamaño pequeño sino también a los de tamaño medianos y grandes si las clases .xol-md- y .col-mx- no están presentes. Lo mismo para la clase .col-md- que no solo se aplicará a los dispositivos medianos sino también a los grandes si la clase .col-mx no está presente. 
</p>

<p>
Ahora la pregunta llega cuando queremos crear columnas y filas usando este sistema responsivo de rejilla de 12 columnas. La respuesta es muy sencilla, al principio creamos un contenedor que actúa como una envoltura para tus filas y columnas usando la clase <b>.row</b> y creamos columnas dentro de cualquier fila usando la clase .col-xs-, .col-sm, .col-md- y col-mx-. Las columnas estarán contenidas realmente en el área en donde tenemos nuestro contenido 
</p>
</div>
</div>
