org/bootstrap.org
** Creando un diseño de 2 columnas

En el siguiente ejemplo vamos a crear un diseño de dos columnas para dispositivos pequeños, medianos y grandes. Por defecto, las columnas se pondrán en disposición horizontal en lo dispositivos móviles. 

#+begin_src html
<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de diseño de 2 columnas para dispositivos pequeños y medianos</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    /* Some custom styles to beautify this example */
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 300px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
</style>
</head>
<body>
    <div class="container">
        <!-- Fila con dos columnas -->
        <div class="row">
            <div class="col-sm-6">
                <div class="demo-content">.col-sm-6</div>
            </div>
            <div class="col-sm-6">
                <div class="demo-content bg-alt">.col-sm-6</div>
            </div>
        </div>
        <hr>
        <!--Row with two columns divided in 1:2 ratio-->
        <div class="row">
            <div class="col-sm-4">
                <div class="demo-content">.col-sm-4</div>
            </div>
            <div class="col-sm-8">
                <div class="demo-content bg-alt">.col-sm-8</div>
            </div>
        </div>
        <hr>
        <!--Row with two columns divided in 1:3 ratio-->
        <div class="row">
            <div class="col-sm-3">
                <div class="demo-content">.col-sm-3</div>
            </div>
            <div class="col-sm-9">
                <div class="demo-content bg-alt">.col-sm-9</div>
            </div>
        </div>
    </div>
</body>
</html>                                		
#+end_src

Como el sistema de rejilla de Bootstrap es de 12 columnas, nosotros para mantener una columna al lado de la otra tenemos que hacer que la suma de las columnas que pongamos sea *12*. 

