doc/html/bootstrap.html

<div id="outline-container-org332ba15" class="outline-3">
<h3 id="org332ba15">Creando un diseño de 2 columnas</h3>
<div class="outline-text-3" id="text-org332ba15">
<p>
En el siguiente ejemplo vamos a crear un diseño de dos columnas para dispositivos pequeños, medianos y grandes. Por defecto, las columnas se pondrán en disposición horizontal en lo dispositivos móviles. 
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"es"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de dise&#241;o de 2 columnas para dispositivos peque&#241;os y medianos</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    /* Some custom styles to beautify this example */
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 300px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Fila con dos columnas </span><span class="org-comment-delimiter">--&gt;</span>
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-6&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-6&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">hr</span>&gt;
        <span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">Row with two columns divided in 1:2 ratio</span><span class="org-comment-delimiter">--&gt;</span>
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-4"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-4&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-8"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-8&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">hr</span>&gt;
        <span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">Row with two columns divided in 1:3 ratio</span><span class="org-comment-delimiter">--&gt;</span>
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-9"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-9&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>

<p>
Como el sistema de rejilla de Bootstrap es de 12 columnas, nosotros para mantener una columna al lado de la otra tenemos que hacer que la suma de las columnas que pongamos sea <b>12</b>. 
</p>
</div>
</div>
