doc/html/bootstrap.html

<div id="outline-container-orgb4f21df" class="outline-3">
<h3 id="orgb4f21df">Creando un diseño de 3 columnas</h3>
<div class="outline-text-3" id="text-orgb4f21df">
<p>
Vamos a hacer lo mismo pero con un diseño de 3 columnas.
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de rejilla con 3 columnas</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    /* Some custom styles to beautify this example */
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 300px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        <span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">Fila con 4 columnas</span><span class="org-comment-delimiter">--&gt;</span>
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-md-4&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-md-4&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-md-4&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">hr</span>&gt;
        <span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">Filas con tres columnas con relaci&#243;n 1:4:1</span><span class="org-comment-delimiter">--&gt;</span>
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-2"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-md-2&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-8"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-md-8&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-2"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-md-2&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">hr</span>&gt;
        <span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">Fila con 3 columnas</span><span class="org-comment-delimiter">--&gt;</span>
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-3"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-md-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-7"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-md-7&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-2"</span>&gt;
              &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-md-2&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                                                       
</pre>
</div>
</div>
</div>
