org/bootstrap.org
** Diseño de Bootstrap con la característica de envoltura de columna

Ahora vamos a crear un diseño aún más flexible que cambia la orientación de la columna basado en el tamaño de la vista del usuario (viewport).
El siguiente ejemplo creará tres columnas en dispositivos medianos pero en pequeños dispositivos se verá con 2 columnas y la tercera se irá al fondo de las dos primeras. 

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title></title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    /* Some custom styles to beautify this example */
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 300px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
    /* Some custom media query to make 
       this example even better */
    @media screen and (max-width: 991px){
        .flexible{
            min-height: 150px;
        }
    }
</style>
</head>
<body>
    <div class="container">
        <div class="row">
            <div class="col-sm-3 col-md-2">
                <div class="demo-content">.col-sm-3 .col-md-2</div>
            </div>
            <div class="col-sm-9 col-md-8">
                <div class="demo-content bg-alt">.col-sm-9 .col-md-8</div>
            </div>
            <div class="col-sm-12 col-md-2">
                <div class="demo-content flexible">.col-sm-12 .col-md-2</div>
            </div>
        </div>
    </div>
</body>
</html>                                		
#+end_src

Como podemos ver la suma de la rejilla de columnas pequeñas (.col-sm-) es 24, mayor que 12. por eso el tercer <div> es envuelto en una nueva línea.

De manera similar podemos rejillas adaptables a nuestras páginas web y aplicaciones. Más adelante, discutiremos más estos aspectos y veremos más ejemplos pero también podemos ver ejemplos muy interesantes [[https://www.tutorialrepublic.com/twitter-bootstrap-tutorial/bootstrap-grid-examples.php][aquí]].

