doc/html/bootstrap.html

<div id="outline-container-org2b395cf" class="outline-3">
<h3 id="org2b395cf">Diseño de Bootstrap con la característica de envoltura de columna</h3>
<div class="outline-text-3" id="text-org2b395cf">
<p>
Ahora vamos a crear un diseño aún más flexible que cambia la orientación de la columna basado en el tamaño de la vista del usuario (viewport).
El siguiente ejemplo creará tres columnas en dispositivos medianos pero en pequeños dispositivos se verá con 2 columnas y la tercera se irá al fondo de las dos primeras. 
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    /* Some custom styles to beautify this example */
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 300px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
    /* Some custom media query to make 
       this example even better */
    @media screen and (max-width: 991px){
        .flexible{
            min-height: 150px;
        }
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3 col-md-2"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3 .col-md-2&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-9 col-md-8"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-9 .col-md-8&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-12 col-md-2"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content flexible"</span>&gt;.col-sm-12 .col-md-2&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>

<p>
Como podemos ver la suma de la rejilla de columnas pequeñas (.col-sm-) es 24, mayor que 12. por eso el tercer &lt;div&gt; es envuelto en una nueva línea.
</p>

<p>
De manera similar podemos rejillas adaptables a nuestras páginas web y aplicaciones. Más adelante, discutiremos más estos aspectos y veremos más ejemplos pero también podemos ver ejemplos muy interesantes <a href="https://www.tutorialrepublic.com/twitter-bootstrap-tutorial/bootstrap-grid-examples.php">aquí</a>.
</p>
</div>
</div>
