doc/html/bootstrap.html

<div id="outline-container-org948d933" class="outline-3">
<h3 id="org948d933">Creando diseños multicolumna con el sistema de rejilla de Bootstrap</h3>
<div class="outline-text-3" id="text-org948d933">
<p>
Veamos la siguiente imagen:
</p>

<p>
En esta imagen vemos un total de 12 cajas en todos los dispositivos solo que su localización varía según el dispositivo par adaptarse a cada uno de ellos. 
</p>

<p>
Ahora la cuestión es como podemos crear semejante diseño responsivo. Vamos a empezar con un dispositivo mediano como un portátil o una computadora de escritorio normal. Vamos a crear un diseño con 3 columnas y 4 filas. El código HTML para conseguir esa estructura podría ser algo así como esto:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de un sistema de varias columnas</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    p{
        padding: 50px;
        font-size: 32px;
        font-weight: bold;
        text-align: center;
        background: #dbdfe5;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 1&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 2&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 3&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 4&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 5&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 6&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 7&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 8&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 9&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 10&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 11&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 12&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                     
</pre>
</div>

<p>
Si vemos esto en un escritorio normal con una salida más grande o igual a 992px  y menos que 1200px veremos 4 filas donde cada fila tiene 3 columnas dando lugar a una rejilla de 3x4.
</p>

<p>
Pero aquí nos podemos encontrar que la altura de algunas columnas puede ser mayor que otras si no limpiamos y rompemos adecuadamente el diseño. Para arreglar esto usamos la clase <b>.clearfix</b> y otras clases responsivas.
</p>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Example of Bootstrap 3 Grid System</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    p{
        padding: 50px;
        font-size: 32px;
        font-weight: bold;
        text-align: center;
        background: #dbdfe5;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Open the output in a new blank tab (Click the arrow next to "Show Output" button) and resize the window to understand how the Bootstrap responsive grid system works. </span><span class="org-comment-delimiter">--&gt;</span>
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 1&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 2&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 3&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 4&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 5&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 6&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 7&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 8&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 9&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 10&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 11&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 12&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                        
</pre>
</div>

<p>
Ahora vamos a optimizar nuestro diseño para otros dispositivos, empezaremos con una rejilla de 2x6 (2 columnas y 6 filas). Para ello usaremos la clase .col-sm-6
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de rejilla para distintos dispositivos</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    p{
        padding: 50px;
        font-size: 32px;
        font-weight: bold;
        text-align: center;
        background: #dbdfe5;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 1&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 2&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 3&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 4&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 5&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 6&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 7&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 8&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 9&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 10&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 11&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 12&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                            
</pre>
</div>

<p>
Ahora cada 2 columnas col-sm-6 tenemos 12, así que limpiaremos cada 2 filas.
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo rejilla para distintos dispositivos</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    p{
        padding: 50px;
        font-size: 32px;
        font-weight: bold;
        text-align: center;
        background: #dbdfe5;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 1&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 2&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 3&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 4&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 5&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 6&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 7&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 8&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 9&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 10&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 11&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 12&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;              
</pre>
</div>


<p>
De manera similar, podemos adaptar el diseño para dispositivos grandes. Finalmente el código queda así:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de rejilla para distintos dispositivos</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    p{
        padding: 50px;
        font-size: 32px;
        font-weight: bold;
        text-align: center;
        background: #dbdfe5;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 1&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 2&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 3&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 4&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-lg-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 5&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 6&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 7&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 8&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-lg-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 9&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-md-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 10&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"clearfix visible-sm-block"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 11&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-md-4 col-lg-3"</span>&gt;&lt;<span class="org-function-name">p</span>&gt;Box 12&lt;/<span class="org-function-name">p</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;            
</pre>
</div>
</div>
</div>
