org/bootstrap.org
** Compensación de las columnas en la rejilla

Podemos mover las columnas en las rejillas a la derecha para propósitos de alineación usando la clase *.col-md-offset-* , *.col-sm-offset*, etc.

Esas clases compensan las columnas incrementando el margen izquierdo. Por ejemplo, la clase .col-sm-offset-4 en la columan .col-sm-8 mueve a la derecha sobre 4 columnas a partir de la posición original.

Ejemplo:

#+begin_src html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de rejilla para varios dispositivos</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 75px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
</style>
</head>
<body>
    <div class="container">
        <div class="row">
            <div class="col-sm-4">
                <div class="demo-content">.col-sm-4</div>
            </div>
            <div class="col-sm-8">
                <div class="demo-content bg-alt">.col-sm-8</div>
            </div>
        </div>
        <div class="row">
            <div class="col-sm-8 col-sm-offset-4">
                <div class="demo-content bg-alt">.col-sm-8 .col-sm-offset-4</div>
            </div>
        </div>
        <hr>
        <div class="row">
            <div class="col-sm-3">
                <div class="demo-content">.col-sm-3</div>
            </div>
            <div class="col-sm-9">
                <div class="demo-content bg-alt">.col-sm-9</div>
            </div>
        </div>
        <div class="row">
            <div class="col-sm-6 col-sm-offset-3">
                <div class="demo-content bg-alt">.col-sm-6 .col-sm-offset-3</div>
            </div>
            <div class="col-sm-3">
                <div class="demo-content">.col-sm-3</div>
            </div>
        </div>
        <hr>
        <div class="row">
            <div class="col-sm-3">
                <div class="demo-content">.col-sm-3</div>
            </div>
            <div class="col-sm-3">
                <div class="demo-content bg-alt">.col-sm-3</div>
            </div>
            <div class="col-sm-3">
                <div class="demo-content">.col-sm-3</div>
            </div>
            <div class="col-sm-3">
                <div class="demo-content bg-alt">.col-sm-3</div>
            </div>
        </div>
        <div class="row">
            <div class="col-sm-3 col-sm-offset-3">
                <div class="demo-content bg-alt">.col-sm-3 .col-sm-offset-3</div>
            </div>
            <div class="col-sm-3 col-sm-offset-3">
                <div class="demo-content">.col-sm-3 .col-sm-offset-3</div>
            </div>
        </div>
    </div>
</body>
</html>           
#+end_src

