doc/html/bootstrap.html

<div id="outline-container-org3d53729" class="outline-3">
<h3 id="org3d53729">Compensación de las columnas en la rejilla</h3>
<div class="outline-text-3" id="text-org3d53729">
<p>
Podemos mover las columnas en las rejillas a la derecha para propósitos de alineación usando la clase <b>.col-md-offset-</b> , <b>.col-sm-offset</b>, etc.
</p>

<p>
Esas clases compensan las columnas incrementando el margen izquierdo. Por ejemplo, la clase .col-sm-offset-4 en la columan .col-sm-8 mueve a la derecha sobre 4 columnas a partir de la posición original.
</p>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de rejilla para varios dispositivos</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .demo-content{
        padding: 15px;
        font-size: 18px;
        min-height: 75px;
        background: #dbdfe5;
        margin-bottom: 10px;
    }
    .demo-content.bg-alt{
        background: #abb1b8;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-4"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-4&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-8"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-8&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-8 col-sm-offset-4"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-8 .col-sm-offset-4&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">hr</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-9"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-9&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-6 col-sm-offset-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-6 .col-sm-offset-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">hr</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3 col-sm-offset-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content bg-alt"</span>&gt;.col-sm-3 .col-sm-offset-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-sm-3 col-sm-offset-3"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"demo-content"</span>&gt;.col-sm-3 .col-sm-offset-3&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;           
</pre>
</div>
</div>
</div>
