org/bootstrap.org
** Rejilla de columnas anidadas

En Bootstrap las rejillas de columnas se pueden anidar, lo que significa que podemos poner filas y columnas dentro de una columna que ya exista. Sin embargo, la formula es la misma, la suma del número de columnas debe ser igual a 12 o menos.

#+begin_src html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Example of Bootstrap 3 Nested Rows and Columns</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
	/* Some custom styles to beautify this example */
    .main-content{
		min-height: 330px;
        background: #dbdfe5;
    }
    .sidebar-content{
        min-height: 150px;
        margin-bottom: 30px;
        background: #b4bac0;
    }
</style>
</head>
<body>
	<!-- Open the output in a new blank tab (Click the arrow next to "Show Output" button) and resize the browser window to understand how the Bootstrap responsive grid system works. -->
	<div class="container">
        <div class="row">
            <div class="col-xs-8">
                <div class="main-content"></div>
            </div>
            <div class="col-xs-4">
                <!--Nested rows within a column-->
                <div class="row">
                    <div class="col-xs-12">
                        <div class="sidebar-content"></div>
                    </div>
                </div>
				<div class="row">
                    <div class="col-xs-12">
                        <div class="sidebar-content"></div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</body>
</html>                                		
#+end_src

