doc/html/bootstrap.html

<div id="outline-container-org8ebcb32" class="outline-3">
<h3 id="org8ebcb32">Rejilla de columnas anidadas</h3>
<div class="outline-text-3" id="text-org8ebcb32">
<p>
En Bootstrap las rejillas de columnas se pueden anidar, lo que significa que podemos poner filas y columnas dentro de una columna que ya exista. Sin embargo, la formula es la misma, la suma del número de columnas debe ser igual a 12 o menos.
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Example of Bootstrap 3 Nested Rows and Columns</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
  /* Some custom styles to beautify this example */
    .main-content{
    min-height: 330px;
        background: #dbdfe5;
    }
    .sidebar-content{
        min-height: 150px;
        margin-bottom: 30px;
        background: #b4bac0;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">Open the output in a new blank tab (Click the arrow next to "Show Output" button) and resize the browser window to understand how the Bootstrap responsive grid system works. </span><span class="org-comment-delimiter">--&gt;</span>
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container"</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-8"</span>&gt;
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"main-content"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
            &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-4"</span>&gt;
                <span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">Nested rows within a column</span><span class="org-comment-delimiter">--&gt;</span>
                &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
                    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-12"</span>&gt;
                        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"sidebar-content"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
                    &lt;/<span class="org-function-name">div</span>&gt;
                &lt;/<span class="org-function-name">div</span>&gt;
        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
                    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-12"</span>&gt;
                        &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"sidebar-content"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
                    &lt;/<span class="org-function-name">div</span>&gt;
                &lt;/<span class="org-function-name">div</span>&gt;
            &lt;/<span class="org-function-name">div</span>&gt;
        &lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>
</div>
</div>
