org/bootstrap.org
** Clases responsivas para Bootstrap

   Podemos usar las siguientes clases responsivas para habilitar la visibilidad de elementos en determinados dispositivos cuya pantalla caiga en un rango de tamaño especificado. 

| Clase        | Descripción                                                       |
|--------------+-------------------------------------------------------------------|
| .visible-xs- | Visible solo en los dispositivos de con anchura de menos de 768px |
| .visible-sm- | Para dispositivos entre 768px y 992px                             |
| .visible-md- | Para dispositivos entre 992px y 1200px                            |
| .visible-lg- | Para dispositivos mayores de 1200px                               |


Ejemplo:

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de clases responsivas</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    p{
        padding: 20px;
        background: #FFF0F5;
        border-radius: 5px;
    }
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <p class="visible-xs">Este párrafo solo se verá en <strong>Dispositivos muy pequeños</strong> that has screen width less than <code>768px</code>.</p>
    <p class="visible-sm">Este párrafo solo se verá en <strong>Pequeños dispositivos</strong> that has screen width greater than equal to <code>768px</code> but less than <code>992px</code>.</p>
    <p class="visible-md">Este párrafo solo se verá en <strong>Dispositivos medianos</strong> that has screen width greater than or equal to <code>992px</code> but less than <code>1200px</code>.</p>
    <p class="visible-lg">Este párrafo solo se verá en <strong>Dispositivos grandes</strong> that has screen width greater than or equal to <code>1200px</code>.</p>
</div>
</body>
</html>                                		
#+end_src

También tenemos las clases *.hide-xs-, .hide-sm-*, etc, que funcionan igual solo que se ocultan en determinados dispositivos.

Otras clases son las *.visible-print-xs, .visible-print-sm*, etc, para dispositivos de impresión.

* Diseños fijos

