doc/html/bootstrap.html

<div id="outline-container-org16d7ff1" class="outline-3">
<h3 id="org16d7ff1">Clases responsivas para Bootstrap</h3>
<div class="outline-text-3" id="text-org16d7ff1">
<p>
Podemos usar las siguientes clases responsivas para habilitar la visibilidad de elementos en determinados dispositivos cuya pantalla caiga en un rango de tamaño especificado. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Clase</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">.visible-xs-</td>
<td class="org-left">Visible solo en los dispositivos de con anchura de menos de 768px</td>
</tr>

<tr>
<td class="org-left">.visible-sm-</td>
<td class="org-left">Para dispositivos entre 768px y 992px</td>
</tr>

<tr>
<td class="org-left">.visible-md-</td>
<td class="org-left">Para dispositivos entre 992px y 1200px</td>
</tr>

<tr>
<td class="org-left">.visible-lg-</td>
<td class="org-left">Para dispositivos mayores de 1200px</td>
</tr>
</tbody>
</table>


<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de clases responsivas</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    p{
        padding: 20px;
        background: #FFF0F5;
        border-radius: 5px;
    }
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"visible-xs"</span>&gt;Este p&#225;rrafo solo se ver&#225; en &lt;<span class="org-function-name">strong</span>&gt;<span class="org-bold">Dispositivos muy peque&#241;os</span>&lt;/<span class="org-function-name">strong</span>&gt; that has screen width less than &lt;<span class="org-function-name">code</span>&gt;768px&lt;/<span class="org-function-name">code</span>&gt;.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"visible-sm"</span>&gt;Este p&#225;rrafo solo se ver&#225; en &lt;<span class="org-function-name">strong</span>&gt;<span class="org-bold">Peque&#241;os dispositivos</span>&lt;/<span class="org-function-name">strong</span>&gt; that has screen width greater than equal to &lt;<span class="org-function-name">code</span>&gt;768px&lt;/<span class="org-function-name">code</span>&gt; but less than &lt;<span class="org-function-name">code</span>&gt;992px&lt;/<span class="org-function-name">code</span>&gt;.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"visible-md"</span>&gt;Este p&#225;rrafo solo se ver&#225; en &lt;<span class="org-function-name">strong</span>&gt;<span class="org-bold">Dispositivos medianos</span>&lt;/<span class="org-function-name">strong</span>&gt; that has screen width greater than or equal to &lt;<span class="org-function-name">code</span>&gt;992px&lt;/<span class="org-function-name">code</span>&gt; but less than &lt;<span class="org-function-name">code</span>&gt;1200px&lt;/<span class="org-function-name">code</span>&gt;.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"visible-lg"</span>&gt;Este p&#225;rrafo solo se ver&#225; en &lt;<span class="org-function-name">strong</span>&gt;<span class="org-bold">Dispositivos grandes</span>&lt;/<span class="org-function-name">strong</span>&gt; that has screen width greater than or equal to &lt;<span class="org-function-name">code</span>&gt;1200px&lt;/<span class="org-function-name">code</span>&gt;.&lt;/<span class="org-function-name">p</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>

<p>
También tenemos las clases <b>.hide-xs-, .hide-sm-</b>, etc, que funcionan igual solo que se ocultan en determinados dispositivos.
</p>

<p>
Otras clases son las <b>.visible-print-xs, .visible-print-sm</b>, etc, para dispositivos de impresión.
</p>
</div>
</div>
</div>
