org/bootstrap.org
** Creando diseños fluidos con Bootstrap

En Bootstrap podemos usar la clase *.container-fluid* para crear diseños fluidos los cuales usaran el 100% de la vista de usuario.

La clase .container-fluid simplemente aplica el margen horizontal con el valor *auto* y al relleno izquierdo y derecho le dejamos 15px de margen (es decir, margin: 0 -15px).

Veamos el siguiente código:

#+begin_src html

<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Diseño fijo con Bootstrap</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    body{
    	padding-top: 70px;
    }
</style>
</head>
<body>
<nav id="myNavbar" class="navbar navbar-default navbar-inverse navbar-fixed-top" role="navigation">
	<div class="container-fluid">
		<div class="navbar-header">
			<button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#navbarCollapse">
				<span class="sr-only">Navegación</span>
				<span class="icon-bar"></span>
				<span class="icon-bar"></span>
				<span class="icon-bar"></span>
			</button>
			<a class="navbar-brand" href="#">Curso de desarrollo web</a>
		</div>
		<div class="collapse navbar-collapse" id="navbarCollapse">
			<ul class="nav navbar-nav">
				<li class="active"><a href="#" target="_blank">Inicio</a></li>
				<li><a href="#" target="_blank">Sobre</a></li>
				<li><a href="#" target="_blank">Contacto</a></li>
			</ul>
		</div>
	</div>
</nav>
<div class="container-fluid">
	<div class="jumbotron">
		<h1>Aprendiendo a crear páginas web</h1>
    <p>Hoy en día el navegador se ha convertido el estándar universal ya que lo podemos encontrar en gran cantidad de dispositivos tales como la televisión, ordenadores, tabletas, móviles y un largo etcetera. Por ello, aprender a crear páginas web, de manera rápida y profesional es una gran ventaja que se nos ofrece para tener gran cantidad de oportunidades</p>
		<p><a href="https://www.maxxcan.com" target="_blank" class="btn btn-success btn-lg">Empieza hoy</a></p>
	</div>
	<div class="row">
		<div class="col-xs-4">
			<h2>HTML</h2>
      <p>HTML es el lenguaje de marcado universal y su conocimiento nos dará la posibilidad de crear páginas web. Además su entendimiento básico nos permitirá introducirnos en la compresión de la gran cantidad de tecnología que hay habilitada para crear contenido</p>
			<p><a href="https://www.maxxcan.com" target="_blank" class="btn btn-success">Quiere saber más? &raquo;</a></p>
		</div>
		<div class="col-xs-4">
			<h2>CSS</h2>
	    <p>Gracias al CSS podemos enfocarnos en el diseño de nuetra página o aplicación web mientras en otro proceso u otra persona se encarga del contenido</p>	
			<p><a href="https://www.maxxcan.com" target="_blank" class="btn btn-success">Quiere saber más? &raquo;</a></p>
		</div>
		<div class="col-xs-4">
			<h2>Bootstrap</h2>
			<p>Bootstrap es un potente framework que nos permite crear de manera sencilla y rápida páginas responsivas de gran calidad</p>
			<p><a href="http://getbootstrap.com/" target="_blank" class="btn btn-success">Para aprender maś&raquo;</a></p>
		</div>
	</div>
	<hr>
	<div class="row">
		<div class="col-xs-12">
			<footer>
				<p>&copy; Copyright 2017 Maxxcan - also Republic Tutorial</p>
			</footer>
		</div>
	</div>
</div>
</body>
</html>                                		

#+end_src
