doc/html/bootstrap.html

<div id="outline-container-org3dcb90f" class="outline-2">
<h2 id="org3dcb90f">Diseños fluidos con Bootstrap</h2>
<div class="outline-text-2" id="text-org3dcb90f">
</div><div id="outline-container-org0ab363c" class="outline-3">
<h3 id="org0ab363c">Creando diseños fluidos con Bootstrap</h3>
<div class="outline-text-3" id="text-org0ab363c">
<p>
En Bootstrap podemos usar la clase <b>.container-fluid</b> para crear diseños fluidos los cuales usaran el 100% de la vista de usuario.
</p>

<p>
La clase .container-fluid simplemente aplica el margen horizontal con el valor <b>auto</b> y al relleno izquierdo y derecho le dejamos 15px de margen (es decir, margin: 0 -15px).
</p>

<p>
Veamos el siguiente código:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Dise&#241;o fijo con Bootstrap</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    body{
      padding-top: 70px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">nav</span> <span class="org-variable-name">id</span>=<span class="org-string">"myNavbar"</span> <span class="org-variable-name">class</span>=<span class="org-string">"navbar navbar-default navbar-inverse navbar-fixed-top"</span> <span class="org-variable-name">role</span>=<span class="org-string">"navigation"</span>&gt;
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container-fluid"</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"navbar-header"</span>&gt;
      &lt;<span class="org-function-name">button</span> <span class="org-variable-name">type</span>=<span class="org-string">"button"</span> <span class="org-variable-name">class</span>=<span class="org-string">"navbar-toggle"</span> <span class="org-variable-name">data-toggle</span>=<span class="org-string">"collapse"</span> <span class="org-variable-name">data-target</span>=<span class="org-string">"#navbarCollapse"</span>&gt;
        &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"sr-only"</span>&gt;Navegaci&#243;n&lt;/<span class="org-function-name">span</span>&gt;
        &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"icon-bar"</span>&gt;&lt;/<span class="org-function-name">span</span>&gt;
        &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"icon-bar"</span>&gt;&lt;/<span class="org-function-name">span</span>&gt;
        &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"icon-bar"</span>&gt;&lt;/<span class="org-function-name">span</span>&gt;
      &lt;/<span class="org-function-name">button</span>&gt;
      &lt;<span class="org-function-name">a</span> <span class="org-variable-name">class</span>=<span class="org-string">"navbar-brand"</span> <span class="org-variable-name">href</span>=<span class="org-string">"#"</span>&gt;Curso de desarrollo web&lt;/<span class="org-function-name">a</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"collapse navbar-collapse"</span> <span class="org-variable-name">id</span>=<span class="org-string">"navbarCollapse"</span>&gt;
      &lt;<span class="org-function-name">ul</span> <span class="org-variable-name">class</span>=<span class="org-string">"nav navbar-nav"</span>&gt;
        &lt;<span class="org-function-name">li</span> <span class="org-variable-name">class</span>=<span class="org-string">"active"</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span>&gt;Inicio&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
        &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span>&gt;Sobre&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
        &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"#"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span>&gt;Contacto&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
      &lt;/<span class="org-function-name">ul</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
  &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">nav</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"container-fluid"</span>&gt;
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"jumbotron"</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;<span class="org-underline"><span class="org-bold">Aprendiendo a crear p&#225;ginas web</span></span>&lt;/<span class="org-function-name">h1</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;Hoy en d&#237;a el navegador se ha convertido el est&#225;ndar universal ya que lo podemos encontrar en gran cantidad de dispositivos tales como la televisi&#243;n, ordenadores, tabletas, m&#243;viles y un largo etcetera. Por ello, aprender a crear p&#225;ginas web, de manera r&#225;pida y profesional es una gran ventaja que se nos ofrece para tener gran cantidad de oportunidades&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://www.maxxcan.com"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span> <span class="org-variable-name">class</span>=<span class="org-string">"btn btn-success btn-lg"</span>&gt;Empieza hoy&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
  &lt;/<span class="org-function-name">div</span>&gt;
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-4"</span>&gt;
      &lt;<span class="org-function-name">h2</span>&gt;<span class="org-underline"><span class="org-bold-italic">HTML</span></span>&lt;/<span class="org-function-name">h2</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;HTML es el lenguaje de marcado universal y su conocimiento nos dar&#225; la posibilidad de crear p&#225;ginas web. Adem&#225;s su entendimiento b&#225;sico nos permitir&#225; introducirnos en la compresi&#243;n de la gran cantidad de tecnolog&#237;a que hay habilitada para crear contenido&lt;/<span class="org-function-name">p</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://www.maxxcan.com"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span> <span class="org-variable-name">class</span>=<span class="org-string">"btn btn-success"</span>&gt;Quiere saber m&#225;s? <span class="org-variable-name">&amp;raquo;</span>&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-4"</span>&gt;
      &lt;<span class="org-function-name">h2</span>&gt;<span class="org-underline"><span class="org-bold-italic">CSS</span></span>&lt;/<span class="org-function-name">h2</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;Gracias al CSS podemos enfocarnos en el dise&#241;o de nuetra p&#225;gina o aplicaci&#243;n web mientras en otro proceso u otra persona se encarga del contenido&lt;/<span class="org-function-name">p</span>&gt;  
      &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://www.maxxcan.com"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span> <span class="org-variable-name">class</span>=<span class="org-string">"btn btn-success"</span>&gt;Quiere saber m&#225;s? <span class="org-variable-name">&amp;raquo;</span>&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-4"</span>&gt;
      &lt;<span class="org-function-name">h2</span>&gt;<span class="org-underline"><span class="org-bold-italic">Bootstrap</span></span>&lt;/<span class="org-function-name">h2</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;Bootstrap es un potente framework que nos permite crear de manera sencilla y r&#225;pida p&#225;ginas responsivas de gran calidad&lt;/<span class="org-function-name">p</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"http://getbootstrap.com/"</span> <span class="org-variable-name">target</span>=<span class="org-string">"_blank"</span> <span class="org-variable-name">class</span>=<span class="org-string">"btn btn-success"</span>&gt;Para aprender ma&#347;<span class="org-variable-name">&amp;raquo;</span>&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
  &lt;/<span class="org-function-name">div</span>&gt;
  &lt;<span class="org-function-name">hr</span>&gt;
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"row"</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"col-xs-12"</span>&gt;
      &lt;<span class="org-function-name">footer</span>&gt;
        &lt;<span class="org-function-name">p</span>&gt;<span class="org-variable-name">&amp;copy;</span> Copyright 2017 Maxxcan - also Republic Tutorial&lt;/<span class="org-function-name">p</span>&gt;
      &lt;/<span class="org-function-name">footer</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
  &lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   

</pre>
</div>
</div>
</div>
</div>
