org/bootstrap.org
* Tipografía en Bootstrap

** Trabajando con cabeceras

En Bootstrap podemos definir cabeceras HTML usando desde *<h1>* hasta *<h6>* de la misma forma que un documento HTML. También podemos usar las clases desde *.h1* hasta *.h6*. 

Veamos este ejemplo:

#+begin_src html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Example of Bootstrap 3 Headings</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <h1>h1. Cabeceras en Bootstrap</h1>
    <h2>h2. Cabeceras en Bootstrap</h2>
    <h3>h3. Cabeceras en Bootstrap</h3>
    <h4>h4. Cabeceras en Bootstrap</h4>
    <h5>h5. Cabeceras en Bootstrap</h5>
    <h6>h6. Cabeceras en Bootstrap</h6>
    <hr>
    <div class="h1">h1. Cabeceras en Bootstrap</div>
    <div class="h2">h2. Cabeceras en Bootstrap</div>
    <div class="h3">h3. Cabeceras en Bootstrap</div>
    <div class="h4">h4. Cabeceras en Bootstrap</div>
    <div class="h5">h5. Cabeceras en Bootstrap</div>
    <div class="h6">h6. Cabeceras en Bootstrap</div>
</div>
</body>
</html>                                		
#+end_src

También podemos usar las etiquetas <small> y <span> o la clase .small, tal como vemos en este ejemplo:


#+begin_src html

<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de cabeceras con Bootstrap</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <h1>h1. Cabeceras en Bootstrap <small>Texto Secundario</small></h1>
    <h2>h2. Cabeceras en Bootstrap <small>Texto Secundario</small></h2>
    <h3>h3. Cabeceras en Bootstrap <small>Texto Secundario</small></h3>
    <h4>h4. Cabeceras en Bootstrap <small>Texto Secundario</small></h4>
    <h5>h5. Cabeceras en Bootstrap <small>Texto Secundario</small></h5>
    <h6>h6. Cabeceras en Bootstrap <small>Texto Secundario</small></h6>
    <hr>
    <h1>h1. Cabeceras en Bootstrap <span class="small">Texto Secundario</span></h1>
    <h2>h2. Cabeceras en Bootstrap <span class="small">Texto Secundario</span></h2>
    <h3>h3. Cabeceras en Bootstrap <span class="small">Texto Secundario</span></h3>
    <h4>h4. Cabeceras en Bootstrap <span class="small">Texto Secundario</span></h4>
    <h5>h5. Cabeceras en Bootstrap <span class="small">Texto Secundario</span></h5>
    <h6>h6. Cabeceras en Bootstrap <span class="small">Texto Secundario</span></h6>
</div>
</body
</html>                                		

#+end_src

