doc/html/bootstrap.html
<div id="outline-container-org037ff1c" class="outline-2">
<h2 id="org037ff1c">Tipografía en Bootstrap</h2>
<div class="outline-text-2" id="text-org037ff1c">
</div><div id="outline-container-org3c11ae1" class="outline-3">
<h3 id="org3c11ae1">Trabajando con cabeceras</h3>
<div class="outline-text-3" id="text-org3c11ae1">
<p>
En Bootstrap podemos definir cabeceras HTML usando desde <b>&lt;h1&gt;</b> hasta <b>&lt;h6&gt;</b> de la misma forma que un documento HTML. También podemos usar las clases desde <b>.h1</b> hasta <b>.h6</b>. 
</p>

<p>
Veamos este ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Example of Bootstrap 3 Headings</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;<span class="org-underline"><span class="org-bold">h1. Cabeceras en Bootstrap</span></span>&lt;/<span class="org-function-name">h1</span>&gt;
    &lt;<span class="org-function-name">h2</span>&gt;<span class="org-underline"><span class="org-bold-italic">h2. Cabeceras en Bootstrap</span></span>&lt;/<span class="org-function-name">h2</span>&gt;
    &lt;<span class="org-function-name">h3</span>&gt;<span class="org-underline"><span class="org-italic">h3. Cabeceras en Bootstrap</span></span>&lt;/<span class="org-function-name">h3</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;<span class="org-underline">h4. Cabeceras en Bootstrap</span>&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">h5</span>&gt;<span class="org-underline">h5. Cabeceras en Bootstrap</span>&lt;/<span class="org-function-name">h5</span>&gt;
    &lt;<span class="org-function-name">h6</span>&gt;<span class="org-underline">h6. Cabeceras en Bootstrap</span>&lt;/<span class="org-function-name">h6</span>&gt;
    &lt;<span class="org-function-name">hr</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"h1"</span>&gt;h1. Cabeceras en Bootstrap&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"h2"</span>&gt;h2. Cabeceras en Bootstrap&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"h3"</span>&gt;h3. Cabeceras en Bootstrap&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"h4"</span>&gt;h4. Cabeceras en Bootstrap&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"h5"</span>&gt;h5. Cabeceras en Bootstrap&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"h6"</span>&gt;h6. Cabeceras en Bootstrap&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>

<p>
También podemos usar las etiquetas &lt;small&gt; y &lt;span&gt; o la clase .small, tal como vemos en este ejemplo:
</p>


<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de cabeceras con Bootstrap</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;h1. Cabeceras en Bootstrap &lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto Secundario</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">h1</span>&gt;
    &lt;<span class="org-function-name">h2</span>&gt;h2. Cabeceras en Bootstrap &lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto Secundario</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">h2</span>&gt;
    &lt;<span class="org-function-name">h3</span>&gt;h3. Cabeceras en Bootstrap &lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto Secundario</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">h3</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;h4. Cabeceras en Bootstrap &lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto Secundario</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">h5</span>&gt;h5. Cabeceras en Bootstrap &lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto Secundario</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">h5</span>&gt;
    &lt;<span class="org-function-name">h6</span>&gt;h6. Cabeceras en Bootstrap &lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto Secundario</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">h6</span>&gt;
    &lt;<span class="org-function-name">hr</span>&gt;
    &lt;<span class="org-function-name">h1</span>&gt;h1. Cabeceras en Bootstrap &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"small"</span>&gt;Texto Secundario&lt;/<span class="org-function-name">span</span>&gt;&lt;/<span class="org-function-name">h1</span>&gt;
    &lt;<span class="org-function-name">h2</span>&gt;h2. Cabeceras en Bootstrap &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"small"</span>&gt;Texto Secundario&lt;/<span class="org-function-name">span</span>&gt;&lt;/<span class="org-function-name">h2</span>&gt;
    &lt;<span class="org-function-name">h3</span>&gt;h3. Cabeceras en Bootstrap &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"small"</span>&gt;Texto Secundario&lt;/<span class="org-function-name">span</span>&gt;&lt;/<span class="org-function-name">h3</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;h4. Cabeceras en Bootstrap &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"small"</span>&gt;Texto Secundario&lt;/<span class="org-function-name">span</span>&gt;&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">h5</span>&gt;h5. Cabeceras en Bootstrap &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"small"</span>&gt;Texto Secundario&lt;/<span class="org-function-name">span</span>&gt;&lt;/<span class="org-function-name">h5</span>&gt;
    &lt;<span class="org-function-name">h6</span>&gt;h6. Cabeceras en Bootstrap &lt;<span class="org-function-name">span</span> <span class="org-variable-name">class</span>=<span class="org-string">"small"</span>&gt;Texto Secundario&lt;/<span class="org-function-name">span</span>&gt;&lt;/<span class="org-function-name">h6</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>
&lt;/<span class="org-function-name">html</span>&gt;                                   

</pre>
</div>
</div>
</div>
