org/bootstrap.org
** Trabajando con párrafos

Bootstrap por defecto usa un tamaño de fuente de *14px*. Esto es aplicado a todos los párrafos del <body>. Podemos sin embargo escribir párrafos sin que sigan estas normas con el uso de la clase *.lead*. 

Ejemplo:

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de párrafos</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <p>Esto es un párrafo normal en Bootstrap.</p>
    <p class="lead">Este párrafo no sigue las normas de Bootstrap.</p>
</div>
</body>
</html>                                		
#+end_src

También podemos de una manera muy fácil alinear el texto de un párrafo con las siguientes clases.

#+begin_src html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de alineación de texto</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <p class="text-left">Texto alineado a la izquierda.</p>
	<p class="text-center">Texto alineado al centro.</p>
	<p class="text-right">Texto alineado a la derecha.</p>
	<p class="text-justify">Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nam eu sem tempor, varius quam at, luctus dui. Mauris magna metus, dapibus nec turpis vel, semper malesuada ante. Vestibulum id metus ac nisl bibendum scelerisque non non purus. Suspendisse varius nibh non aliquet sagittis. In tincidunt orci sit amet elementum vestibulum. Vivamus fermentum in arcu in aliquam.</p>
	<p class="text-nowrap">Texto palomita suelta.</p>
</div>
</body>
</html>           
#+end_src

