org/bootstrap.org
** Formateado de texto

Para formatear texto en Bootstrap podemos usar las etiquetas *<strong>,<i>,<small>* para tener el texto en negrita, itálica y pequeño.

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Example of Bootstrap 3 Text Formatting</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <p><b>Texto en negrita</b></p>
    <p><big>Texto grande</big></p>
    <p><code>Texto de computadora</code></p>
    <p><em>Texto emfatizado</em></p>
    <p><i>Texto en itálica</i></p>
    <p><mark>Texto resaltado</mark></p>
    <p><small>Texto pequeño</small></p>
    <p><strong>Texto fuertemente emfatizado</strong></p>
    <p>Esto es un <sub>subíndice</sub> y un <sup>superíndice</sup></p>
    <p><ins>Texto insertado</ins></p>
    <p><del>Texto eliminado</del></p>
</div>
</body>
</html>             
#+end_src

** Clases para transformar texto

   Podemos transformar texto transformándolo en minúscula, mayúscula o en texto capitalizado.

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de transformación del texto</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <p class="text-lowercase">Ponemos todo el texto en minúscula.</p>
    <p class="text-uppercase">Ponemos todo el texto en mayúscula.</p>
    <p class="text-capitalize">Capitalizamos el texto.</p>
</div>
</body>
</html>                                		
#+end_src

