doc/html/bootstrap.html

<div id="outline-container-org00bf998" class="outline-3">
<h3 id="org00bf998">Formateado de texto</h3>
<div class="outline-text-3" id="text-org00bf998">
<p>
Para formatear texto en Bootstrap podemos usar las etiquetas <b>&lt;strong&gt;,&lt;i&gt;,&lt;small&gt;</b> para tener el texto en negrita, itálica y pequeño.
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Example of Bootstrap 3 Text Formatting</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">b</span>&gt;<span class="org-bold">Texto en negrita</span>&lt;/<span class="org-function-name">b</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">big</span>&gt;<span class="org-bold">Texto grande</span>&lt;/<span class="org-function-name">big</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">code</span>&gt;Texto de computadora&lt;/<span class="org-function-name">code</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">em</span>&gt;<span class="org-italic">Texto emfatizado</span>&lt;/<span class="org-function-name">em</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">i</span>&gt;<span class="org-italic">Texto en it&#225;lica</span>&lt;/<span class="org-function-name">i</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">mark</span>&gt;Texto resaltado&lt;/<span class="org-function-name">mark</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">small</span>&gt;<span class="org-default">Texto peque&#241;o</span>&lt;/<span class="org-function-name">small</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">strong</span>&gt;<span class="org-bold">Texto fuertemente emfatizado</span>&lt;/<span class="org-function-name">strong</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;Esto es un &lt;<span class="org-function-name">sub</span>&gt;sub&#237;ndice&lt;/<span class="org-function-name">sub</span>&gt; y un &lt;<span class="org-function-name">sup</span>&gt;super&#237;ndice&lt;/<span class="org-function-name">sup</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">ins</span>&gt;Texto insertado&lt;/<span class="org-function-name">ins</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span>&gt;&lt;<span class="org-function-name">del</span>&gt;Texto eliminado&lt;/<span class="org-function-name">del</span>&gt;&lt;/<span class="org-function-name">p</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;             
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf783d11" class="outline-3">
<h3 id="orgf783d11">Clases para transformar texto</h3>
<div class="outline-text-3" id="text-orgf783d11">
<p>
Podemos transformar texto transformándolo en minúscula, mayúscula o en texto capitalizado.
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de transformaci&#243;n del texto</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-lowercase"</span>&gt;Ponemos todo el texto en min&#250;scula.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-uppercase"</span>&gt;Ponemos todo el texto en may&#250;scula.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-capitalize"</span>&gt;Capitalizamos el texto.&lt;/<span class="org-function-name">p</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>
</div>
</div>
