org/bootstrap.org
** Clases para enfatizar el texto

Los colores son muy poderosos para mostrar información y resaltar cierto contenido.

Bootstrap tiene unas cuantas clases para resaltar este contenido usando distingos colores. 

#+begin_src html

<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de texto resaltado con Bootstrap</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
    <p class="text-muted">Texto mutado. Se le pone gris para que sea menos visible.</p>
    <p class="text-primary">Importante: Texto con cierta importancia.</p>
    <p class="text-success">Éxito. Ponemos un color llamativo y alegre.</p>
    <p class="text-info">Nota: Un color moderado para un mensaje de aviso.</p>
    <p class="text-warning">Aviso: Texto donde alertamos de algo con un color llamativo</p>
    <p class="text-danger">Error o peligro: Con este tipo de texto avisamos de algo muy importante y urgente.</p>
</div>
</body>
</html>              

#+end_src



** Bloques de citas con estilo

Para terminar usaremos la etiqueta *<blockquote>* . Veamos un ejemplo:

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de cita con Bootstrap</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
	<blockquote>
    	<p>Sólo conozco dos cosas infinitas, el universo y la estupidez humana y de lo primero tengo dudas</p>
    	<small>Por <cite>Albert Einstein</cite></small>
    </blockquote>
</div>
</body>
</html>                                		
#+end_src

De manera alternativa podemos alinear la cita a la derecha usando la clase *.pull-right* en el elemento *<blockquote>* 

Ejemplo:

#+begin_src html
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ejemplo de cita con Bootstrap</title>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
<style type="text/css">
    .bs-example{
    	margin: 20px;
    }
</style>
</head>
<body>
<div class="bs-example">
	<blockquote class="pull-right">
    	<p>Sólo conozco dos cosas infinitas, el universo y la estupidez humana y de lo primero tengo dudas</p>
    	<small>Por <cite>Albert Einstein</cite></small>
    </blockquote>
</div>
</body>
</html>                                		
#+end_src

