doc/html/bootstrap.html

<div id="outline-container-orga2726d5" class="outline-3">
<h3 id="orga2726d5">Clases para enfatizar el texto</h3>
<div class="outline-text-3" id="text-orga2726d5">
<p>
Los colores son muy poderosos para mostrar información y resaltar cierto contenido.
</p>

<p>
Bootstrap tiene unas cuantas clases para resaltar este contenido usando distingos colores. 
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de texto resaltado con Bootstrap</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-muted"</span>&gt;Texto mutado. Se le pone gris para que sea menos visible.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-primary"</span>&gt;Importante: Texto con cierta importancia.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-success"</span>&gt;&#201;xito. Ponemos un color llamativo y alegre.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-info"</span>&gt;Nota: Un color moderado para un mensaje de aviso.&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-warning"</span>&gt;Aviso: Texto donde alertamos de algo con un color llamativo&lt;/<span class="org-function-name">p</span>&gt;
    &lt;<span class="org-function-name">p</span> <span class="org-variable-name">class</span>=<span class="org-string">"text-danger"</span>&gt;Error o peligro: Con este tipo de texto avisamos de algo muy importante y urgente.&lt;/<span class="org-function-name">p</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;              

</pre>
</div>
</div>
</div>



<div id="outline-container-org8bacdd0" class="outline-3">
<h3 id="org8bacdd0">Bloques de citas con estilo</h3>
<div class="outline-text-3" id="text-org8bacdd0">
<p>
Para terminar usaremos la etiqueta <b>&lt;blockquote&gt;</b> . Veamos un ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de cita con Bootstrap</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
  &lt;<span class="org-function-name">blockquote</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;S&#243;lo conozco dos cosas infinitas, el universo y la estupidez humana y de lo primero tengo dudas&lt;/<span class="org-function-name">p</span>&gt;
      &lt;<span class="org-function-name">small</span>&gt;Por &lt;<span class="org-function-name">cite</span>&gt;<span class="org-italic">Albert Einstein</span>&lt;/<span class="org-function-name">cite</span>&gt;&lt;/<span class="org-function-name">small</span>&gt;
    &lt;/<span class="org-function-name">blockquote</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>

<p>
De manera alternativa podemos alinear la cita a la derecha usando la clase <b>.pull-right</b> en el elemento <b>&lt;blockquote&gt;</b> 
</p>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="org-string">&lt;!DOCTYPE html&gt;</span>
&lt;<span class="org-function-name">html</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"utf-8"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">http-equiv</span>=<span class="org-string">"X-UA-Compatible"</span> <span class="org-variable-name">content</span>=<span class="org-string">"IE=edge"</span>&gt;
&lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1"</span>&gt;
&lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Ejemplo de cita con Bootstrap</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;<span class="org-function-name">link</span> <span class="org-variable-name">rel</span>=<span class="org-string">"stylesheet"</span> <span class="org-variable-name">href</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">script</span> <span class="org-variable-name">src</span>=<span class="org-string">"https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"</span>&gt;&lt;/<span class="org-function-name">script</span>&gt;
&lt;<span class="org-function-name">style</span> <span class="org-variable-name">type</span>=<span class="org-string">"text/css"</span>&gt;
    .bs-example{
      margin: 20px;
    }
&lt;/<span class="org-function-name">style</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;
&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"bs-example"</span>&gt;
  &lt;<span class="org-function-name">blockquote</span> <span class="org-variable-name">class</span>=<span class="org-string">"pull-right"</span>&gt;
      &lt;<span class="org-function-name">p</span>&gt;S&#243;lo conozco dos cosas infinitas, el universo y la estupidez humana y de lo primero tengo dudas&lt;/<span class="org-function-name">p</span>&gt;
      &lt;<span class="org-function-name">small</span>&gt;Por &lt;<span class="org-function-name">cite</span>&gt;<span class="org-italic">Albert Einstein</span>&lt;/<span class="org-function-name">cite</span>&gt;&lt;/<span class="org-function-name">small</span>&gt;
    &lt;/<span class="org-function-name">blockquote</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;                                   
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Patricio Martínez</p>
<p class="date">Created: 2017-07-25 mar 12:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
